# DataFrame 데이터 필터링

In [1]:
import pandas as pd

In [20]:
df = pd.DataFrame({
    'name':     ['Celine','James','Jason','Hans'],
    'nation':   ['France','UK','USA','Germany'],
    'english':  [90,80,80,60],
    'math':     [100,40,40,50],
    'science':  [100,30,60,90]
})
df

     name   nation  english  math  science
0  Celine   France       90   100      100
1   James       UK       80    40       30
2   Jason      USA       80    40       60
3    Hans  Germany       60    50       90

In [21]:
is_usa = df['nation'] == 'USA'
is_usa

0    False
1    False
2     True
3    False
Name: nation, dtype: bool

In [22]:
df[is_usa]

    name nation  english  math  science
2  Jason    USA       80    40       60

In [3]:
is_celine = df['name'] == 'Celine'
df_celine = df[is_celine]
df_celine

     name  nation  english  math  science
0  Celine  France       90   100      100

In [8]:
total = df['english'] + df['math'] + df['science']
df['total'] = total
df

     name   nation  english  math  science  total
0  Celine   France       90   100      100    290
1   James       UK       80    40       30    150
2   Jason      USA       80    40       60    180
3    Hans  Germany       60    50       90    200

In [9]:
is_honor = df['total'] >= 200
df_honor = df[is_honor]
df_honor

     name   nation  english  math  science  total
0  Celine   France       90   100      100    290
3    Hans  Germany       60    50       90    200

## 두 가지 조건

In [23]:
is_math_100 = df['math'] == 100
is_science_100 = df['science'] == 100
df_excellent = df[is_math_100 & is_science_100]
df_excellent

     name  nation  english  math  science
0  Celine  France       90   100      100

In [25]:
is_math_100 = df['math'] == 100
is_usa = df['nation'] == 'USA'
df_result = df[is_math_100 | is_usa]
df_result

     name  nation  english  math  science
0  Celine  France       90   100      100
2   Jason     USA       80    40       60

## 문자열 포함

In [26]:
is_u = df['nation'].str.contains('U')
df_u = df[is_u]
df_u

    name nation  english  math  science
1  James     UK       80    40       30
2  Jason    USA       80    40       60